CO2_BASE/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (1.2 0 0)
    (1.2 1 0)
    (0 1 0)
    (0 0 0.2)
    (1.2 0 0.2)
    (1.2 1 0.2)
    (0 1 0.2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
