CO2_BASE/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    leftWall
    {
        // Cambiamos la condición para que actúe como inlet: se fija una velocidad de inyección
        type            fixedValue;
        value           uniform (0.1 0 0); // Por ejemplo, 0.1 m/s en dirección x
    }

    topWall
    {
        type            noSlip;
    }

    lowerWall
    {
        type            noSlip;
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    cylinder
    {
        type            noSlip;  // Pared rígida sin movimiento, simulando la roca
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
